package Lesson_2.HomeTaskString;
// Дана строка: «СегоДНЯ ОченЬ ХороШАя ПоГоДа»
// Привести строку к нижнему регистру.
public class Task1 {
    public static void main(String[] args) {
        String str = "СегоДНЯ ОченЬ ХороШАя ПоГоДа";
        System.out.println(str.toLowerCase());
    }
}
